;=================================
;这里是系统函数调用的实现
;思路： eax传递调用的功能号
;       0x80相应地址
;王征-2014-02-22
;=================================
extern put_string
[bits 32]
global sys_put_str
global sys_put_string
;======================================================================== 
sys_put_string:                                 ;显示0终止的字符串并移动光标 
              push ebx
			  call put_string
			  add esp,4
              ret                               ;段间返回
;---------------------------------------------------------------		 
;系统输出函数使用
sys_put_str:
            mov eax,0x00
			mov ebx,[esp+4]
			int 0x80
			ret 